package ru.itsjava.exsercises.excersise3;

import ru.itsjava.init.UniversityInitializer;
import ru.itsjava.model.Student;

import java.util.List;

public class FilterPractice {

    public static void main(String[] args) {
        List<Student> students = UniversityInitializer.initStudents();
        System.out.println(students);


//  Найти количество всех студентов, которые учатся на гуманитарном факультете


//  Найти количество всех студентов,
//  которые учатся на факультете старше 1969 года

    }
}

//stream -- рецепт создания коллекции
